In [2]:
import pandas as pd

In [3]:
d1 = pd.read_csv("./cities.csv")
d2 = pd.read_csv("./countries.csv")
d3 = pd.read_csv("./states.csv")

In [4]:
d1.head()

,city_name,alt_names,country_code,state_code,lat,lon,population
0,vila,"['casas vila', 'vila']",AD,03,42.53176,1.56654,1418
1,soldeu,"[""sol'deu"", 'soldeu', 'surudeu', 'swldw', 'сол...",AD,02,42.57688,1.66769,602
2,sispony,['sispony'],AD,04,42.53368,1.51613,833
3,el tarter,"['ehl tarter', 'el tarter', ""el tarter - princ...",AD,02,42.57952,1.65362,1052
4,sant julià de lòria,"['san julia', 'san julià', 'sant julia de lori...",AD,06,42.46372,1.49129,8022

In [5]:
d2.head()

,iso_code,country_name,capital,continent,population,area_sq_km,currency
0,AD,andorra,Andorra la Vella,EU,77006,468.0,EUR
1,AE,united arab emirates,Abu Dhabi,AS,9630959,82880.0,AED
2,AF,afghanistan,Kabul,AS,37172386,647500.0,AFN
3,AG,antigua and barbuda,St. John's,NaN,96286,443.0,XCD
4,AI,anguilla,The Valley,NaN,13254,102.0,XCD

In [6]:
d3.head()

  country_code state_code           state_name  geonameid
0           AD         06  sant julià de loria    3039162
1           AD         05               ordino    3039676
2           AD         04           la massana    3040131
3           AD         03               encamp    3040684
4           AD         02              canillo    3041203

In [10]:
print(d1[d1['city_name'] == 'bengaluru'])

        city_name                                          alt_names  \
114903  bengaluru  ['blr', "ban'nkalor", 'bangalor', 'bangalore',...

       country_code state_code       lat       lon  population
114903           IN         19  12.97194  77.59369     8495492